from sage.all import *


# Импортируем необходимые модули
GF2 = GF(2)  # Определяем поле GF(2)

M = matrix(GF2, [
  [0, 0, 0, 0, 0, 1, 0, 1, 0, 1],
  [0, 0, 0, 0, 1, 0, 1, 1, 1, 0],
  [0, 0, 0, 1, 0, 0, 1, 1, 0, 0],
  [0, 0, 0, 1, 1, 1, 0, 1, 1, 1],
  [0, 0, 1, 0, 0, 1, 0, 0, 0, 0],
  [0, 0, 1, 0, 1, 0, 1, 0, 1, 1],
  [0, 0, 1, 1, 0, 0, 1, 0, 0, 1],
  [0, 0, 1, 1, 1, 1, 0, 0, 1, 0],
  [0, 1, 0, 0, 0, 0, 1, 0, 1, 0],
  [0, 1, 0, 0, 1, 1, 0, 0, 0, 1],
  [0, 1, 0, 1, 0, 1, 0, 0, 1, 1],
  [0, 1, 0, 1, 1, 0, 1, 0, 0, 0],
  [0, 1, 1, 0, 0, 0, 1, 1, 1, 1],
  [0, 1, 1, 0, 1, 1, 0, 1, 0, 0],
  [0, 1, 1, 1, 0, 1, 0, 1, 1, 0],
  [0, 1, 1, 1, 1, 0, 1, 1, 0, 1],
  [1, 0, 0, 0, 0, 0, 0, 1, 0, 0],
  [1, 0, 0, 0, 1, 1, 1, 1, 1, 1],
  [1, 0, 0, 1, 0, 1, 1, 1, 0, 1],
  [1, 0, 0, 1, 1, 0, 0, 1, 1, 0],
  [1, 0, 1, 0, 0, 0, 0, 0, 0, 1],
  [1, 0, 1, 0, 1, 1, 1, 0, 1, 0],
  [1, 0, 1, 1, 0, 1, 1, 0, 0, 0],
  [1, 0, 1, 1, 1, 0, 0, 0, 1, 1],
  [1, 1, 0, 0, 0, 1, 1, 0, 1, 1],
  [1, 1, 0, 0, 1, 0, 0, 0, 0, 0],
  [1, 1, 0, 1, 0, 0, 0, 0, 1, 0],
  [1, 1, 0, 1, 1, 1, 1, 0, 0, 1],
  [1, 1, 1, 0, 0, 1, 1, 1, 1, 0],
  [1, 1, 1, 0, 1, 0, 0, 1, 0, 1],
  [1, 1, 1, 1, 0, 0, 0, 1, 1, 1],
  [1, 1, 1, 1, 1, 1, 1, 1, 0, 0],
])

# Находим ранг матрицы
rank = M.rank()

show(rank)

# Проверяем количество векторов
num_vectors = M.nrows()

print("векторов:", num_vectors)

# Определяем линейную зависимость
if rank < num_vectors:
    print("Линейная зависимость найдена.")
else:
    print("Векторы линейно независимы.")


# Приводим матрицу к ступенчатой форме
E = M.echelon_form()

# Находим линейно независимые векторы
independent_vectors = []
for i in range(E.nrows()):
    if any(E[i, :]):  # Проверяем, есть ли ненулевые элементы в строке
        independent_vectors.append(M[i])

# Выводим линейно независимые векторы
print("Линейно независимые векторы:")
for vec in independent_vectors:
    print(vec)
