from sage.all import *

var('q')

"""
# Матрица Хекке
R = matrix([
  [q,0,        0,0],
  [0,0,        1,0],
  [0,1,q-q**(-1),0],
  [0,0,        0,q]
])
"""

"""
# Семейство Белавина–Дринафельда
R = matrix([
  [1,   0,   0, 0],
  [0,   q, 1-q, 0],
  [0, 1+q,  -q, 0],
  [0,   0,   0, 1]
])
"""

"""
# Антисимметрическое (суперсимметрическое) решение
R = matrix([
  [1, 0, 0,0],
  [0, 0,-1,0],
  [0,-1, 0,0],
  [0, 0, 0,1]
])
"""

"""
# Джордановское нетривиальное решение
R = matrix([
  [1, 0, 0, 0],
  [0, 1, 1, 0],
  [0, 0, 1, 0],
  [0, 0, 0, 1]
])
"""

#'''
# Оператор перестановки
R = matrix([
  [1, 0, 0, 0],
  [0, 0, 1, 0],
  [0, 1, 0, 0],
  [0, 0, 0, 1]
])
#'''


Id = matrix([
  [1,0],
  [0,1]
])

m_1 = Id.tensor_product(R)
m_2 = R.tensor_product(Id)

m = m_1*m_1
print("(I x R)(I x R)")
show(m)


m = m_2*m_2
print("")
print("(R x I)(R x I)")
show(m)
